---
kind: method
id: M:Autodesk.Revit.DB.Wall.Flip
zh: 墙、墙体
source: html/4fa072e8-7840-66bc-78a4-e13ef24f0d41.htm
---
# Autodesk.Revit.DB.Wall.Flip Method

**中文**: 墙、墙体

The wall orientation will be flipped.

## Syntax (C#)
```csharp
public void Flip()
```